# Core
brew "git"
brew "stow"             # symlink manager for dotfiles
brew "just"             # task runner for install/link/update commands
brew "wget"             # download utility (not included with macOS)

# Shell
brew "starship"         # cross-shell prompt, fast and customizable

# Search / navigation
brew "fzf"              # fuzzy finder for files, command history, etc.
brew "ripgrep"          # very fast grep alternative (rg command)
brew "fd"               # fast, user-friendly alternative to find
brew "eza"              # modern ls replacement with colors, git status, tree view
brew "zoxide"           # smarter cd that learns your most-used directories

# Development utilities
brew "jq"               # command-line JSON processor
brew "yq"               # command-line YAML processor
brew "gh"               # GitHub CLI for PRs, issues, repos
brew "tree"             # prints directory structure as a tree

# Python — uv handles version management, virtual environments, and deps in one tool
brew "uv"

# Node — pnpm is the primary package manager (faster installs, shared content-addressable store)
brew "pnpm"

# Ruby — version manager similar to SDKMAN for Java
brew "rbenv"
brew "ruby-build"       # rbenv plugin to install Ruby versions

# IDEs
cask "antigravity"      # Google's Antigravity IDE

# Productivity
cask "alfred"           # app launcher and productivity tool

# AI CLIs
cask "claude"           # Anthropic's Claude Code CLI
brew "gemini-cli"       # Google's Gemini CLI
cask "codex"            # OpenAI's Codex CLI

# Java
# springboot is managed via SDKMAN (see sdkman.zsh) — pivotal/tap formula is broken
brew "maven"            # Java build tool

# Document processing
brew "pandoc"           # universal document converter (markdown → PDF, DOCX, etc.)

# Shell tooling
brew "shellcheck"       # static analysis / linter for shell scripts

# Docker
brew "lazydocker"       # terminal UI for Docker and Docker Compose

# Git
brew "git-lfs"          # Git Large File Storage — handles binary assets in repos
brew "gitleaks"
